# Advanced Querying Mongo

Importing libraries and setting up connection

In [1]:
from pymongo import MongoClient
client = MongoClient("mongodb://localhost:27017")
import pandas as pd

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [25]:
db=client.companies
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'companies')

In [28]:
colec = db.colection

In [29]:
list(colec.find().limit(1))

[{'_id': ObjectId('52cdef7c4bab8bd675297d8a'),
  'name': 'Wetpaint',
  'permalink': 'abc2',
  'crunchbase_url': 'http://www.crunchbase.com/company/wetpaint',
  'homepage_url': 'http://wetpaint-inc.com',
  'blog_url': 'http://digitalquarters.net/',
  'blog_feed_url': 'http://digitalquarters.net/feed/',
  'twitter_username': 'BachelrWetpaint',
  'category_code': 'web',
  'number_of_employees': 47,
  'founded_year': 2005,
  'founded_month': 10,
  'founded_day': 17,
  'deadpooled_year': 1,
  'tag_list': 'wiki, seattle, elowitz, media-industry, media-platform, social-distribution-system',
  'alias_list': '',
  'email_address': 'info@wetpaint.com',
  'phone_number': '206.859.6300',
  'description': 'Technology Platform Company',
  'created_at': datetime.datetime(2007, 5, 25, 6, 51, 27),
  'updated_at': 'Sun Dec 08 07:15:44 UTC 2013',
  'overview': '<p>Wetpaint is a technology platform company that uses its proprietary state-of-the-art technology and expertise in social media to build and monetize audiences for digital publishers. Wetpaint’s own online property, Wetpaint Entertainment, an entertainment news site that attracts more than 12 million unique visitors monthly and has over 2 million Facebook fans, is a proof point to the company’s success in building and engaging audiences. Media companies can license Wetpaint’s platform which includes a dynamic playbook tailored to their individual needs and comprehensive training. Founded by Internet pioneer Ben Elowitz, and with offices in New York and Seattle, Wetpaint is backed by Accel Partners, the investors behind Facebook.</p>',
  'image': {'available_sizes': [[[150, 75],
     'assets/images/resized/0000/3604/3604v14-max-150x150.jpg'],
    [[250, 125], 'assets/images/resized/0000/3604/3604v14-max-250x250.jpg'],
    [[450, 225], 'assets/images/resized/0000/3604/3604v14-max-450x450.jpg']]},
  'products': [{'name': 'Wikison Wetpaint', 'permalink': 'wetpaint-wiki'},
   {'name': 'Wetpaint Social Distribution System',
    'permalink': 'wetpaint-social-distribution-system'}],
  'relationships': [{'is_past': False,
    'title': 'Co-Founder and VP, Social and Audience Development',
    'person': {'first_name': 'Michael',
     'last_name': 'Howell',
     'permalink': 'michael-howell'}},
   {'is_past': False,
    'title': 'Co-Founder/CEO/Board of Directors',
    'person': {'first_name': 'Ben',
     'last_name': 'Elowitz',
     'permalink': 'ben-elowitz'}},
   {'is_past': False,
    'title': 'COO/Board of Directors',
    'person': {'first_name': 'Rob',
     'last_name': 'Grady',
     'permalink': 'rob-grady'}},
   {'is_past': False,
    'title': 'SVP, Strategy and Business Development',
    'person': {'first_name': 'Chris',
     'last_name': 'Kollas',
     'permalink': 'chris-kollas'}},
   {'is_past': False,
    'title': 'Board',
    'person': {'first_name': 'Theresia',
     'last_name': 'Ranzetta',
     'permalink': 'theresia-ranzetta'}},
   {'is_past': False,
    'title': 'Board Member',
    'person': {'first_name': 'Gus',
     'last_name': 'Tai',
     'permalink': 'gus-tai'}},
   {'is_past': False,
    'title': 'Board',
    'person': {'first_name': 'Len',
     'last_name': 'Jordan',
     'permalink': 'len-jordan'}},
   {'is_past': False,
    'title': 'Head of Technology and Product',
    'person': {'first_name': 'Alex',
     'last_name': 'Weinstein',
     'permalink': 'alex-weinstein'}},
   {'is_past': True,
    'title': 'CFO',
    'person': {'first_name': 'Bert',
     'last_name': 'Hogue',
     'permalink': 'bert-hogue'}},
   {'is_past': True,
    'title': 'CFO/ CRO',
    'person': {'first_name': 'Brian',
     'last_name': 'Watkins',
     'permalink': 'brian-watkins'}},
   {'is_past': True,
    'title': 'Senior Vice President, Marketing',
    'person': {'first_name': 'Rob',
     'last_name': 'Grady',
     'permalink': 'rob-grady'}},
   {'is_past': True,
    'title': 'VP, Technology and Product',
    'person': {'first_name': 'Werner',
     'last_name': 'Koepf',
     'permalink': 'werner-koepf'}},
   {'is_past': True,
    'title': 'VP Marketing',
    'person': {'first_name': 'Kevin',
     'last_name': 'Flaherty',
     'permalink': 'kevin-flaherty'}},
   {'is_past': True,
    'title': 'VP User Experience',
    'person': {'first_name': 'Alex',
     'last_name': 'Berg',
     'permalink': 'alex-berg'}},
   {'is_past': True,
    'title': 'VP Engineering',
    'person': {'first_name': 'Steve',
     'last_name': 'McQuade',
     'permalink': 'steve-mcquade'}},
   {'is_past': True,
    'title': 'Executive Editor',
    'person': {'first_name': 'Susan',
     'last_name': 'Mulcahy',
     'permalink': 'susan-mulcahy'}},
   {'is_past': True,
    'title': 'VP Business Development',
    'person': {'first_name': 'Chris',
     'last_name': 'Kollas',
     'permalink': 'chris-kollas'}}],
  'competitions': [{'competitor': {'name': 'Wikia', 'permalink': 'wikia'}},
   {'competitor': {'name': 'JotSpot', 'permalink': 'jotspot'}},
   {'competitor': {'name': 'Socialtext', 'permalink': 'socialtext'}},
   {'competitor': {'name': 'Ning by Glam Media', 'permalink': 'ning'}},
   {'competitor': {'name': 'Soceeo', 'permalink': 'soceeo'}},
   {'competitor': {'name': 'Yola', 'permalink': 'yola'}},
   {'competitor': {'name': 'SocialGO', 'permalink': 'socialgo'}},
   {'competitor': {'name': 'IslamNor', 'permalink': 'islamnor'}}],
  'providerships': [],
  'total_money_raised': '$39.8M',
  'funding_rounds': [{'id': 888,
    'round_code': 'a',
    'source_url': 'http://seattlepi.nwsource.com/business/246734_wiki02.html',
    'source_description': '',
    'raised_amount': 5250000,
    'raised_currency_code': 'USD',
    'funded_year': 2005,
    'funded_month': 10,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None}]},
   {'id': 889,
    'round_code': 'b',
    'source_url': 'http://pulse2.com/2007/01/09/wiki-builder-website-wetpaint-welcomes-95m-funding/',
    'source_description': '',
    'raised_amount': 9500000,
    'raised_currency_code': 'USD',
    'funded_year': 2007,
    'funded_month': 1,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': {'name': 'Accel Partners',
       'permalink': 'accel-partners'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None}]},
   {'id': 2312,
    'round_code': 'c',
    'source_url': 'http://www.accel.com/news/news_one_up.php?news_id=185',
    'source_description': 'Accel',
    'raised_amount': 25000000,
    'raised_currency_code': 'USD',
    'funded_year': 2008,
    'funded_month': 5,
    'funded_day': 19,
    'investments': [{'company': None,
      'financial_org': {'name': 'DAG Ventures', 'permalink': 'dag-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Accel Partners',
       'permalink': 'accel-partners'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None}]}],
  'investments': [],
  'acquisition': {'price_amount': 30000000,
   'price_currency_code': 'USD',
   'term_code': 'cash_and_stock',
   'source_url': 'http://allthingsd.com/20131216/viggle-tries-to-bulk-up-its-social-tv-business-by-buying-wetpaint/?mod=atdtweet',
   'source_description': ' Viggle Tries to Bulk Up Its Social TV Business by Buying Wetpaint',
   'acquired_year': 2013,
   'acquired_month': 12,
   'acquired_day': 16,
   'acquiring_company': {'name': 'Viggle', 'permalink': 'viggle'}},
  'acquisitions': [],
  'offices': [{'description': '',
    'address1': '710 - 2nd Avenue',
    'address2': 'Suite 1100',
    'zip_code': '98104',
    'city': 'Seattle',
    'state_code': 'WA',
    'country_code': 'USA',
    'latitude': 47.603122,
    'longitude': -122.333253},
   {'description': '',
    'address1': '270 Lafayette Street',
    'address2': 'Suite 505',
    'zip_code': '10012',
    'city': 'New York',
    'state_code': 'NY',
    'country_code': 'USA',
    'latitude': 40.7237306,
    'longitude': -73.9964312}],
  'milestones': [{'id': 5869,
    'description': "Wetpaint named in Lead411's Hottest Seattle Companies list",
    'stoned_year': 2010,
    'stoned_month': 6,
    'stoned_day': 8,
    'source_url': 'http://www.lead411.com/seattle-companies.html',
    'source_text': None,
    'source_description': 'LEAD411 LAUNCHES "HOTTEST SEATTLE COMPANIES" AWARDS',
    'stoneable_type': 'Company',
    'stoned_value': None,
    'stoned_value_type': None,
    'stoned_acquirer': None,
    'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}},
   {'id': 8702,
    'description': 'Site-Builder Wetpaint Makes One For Itself, Using the Demand Media Playbook',
    'stoned_year': 2010,
    'stoned_month': 9,
    'stoned_day': 6,
    'source_url': 'http://mediamemo.allthingsd.com/20100906/site-builder-wetpaint-makes-one-for-itself-using-the-demand-media-playbook/',
    'source_text': None,
    'source_description': 'All Things D',
    'stoneable_type': 'Company',
    'stoned_value': None,
    'stoned_value_type': None,
    'stoned_acquirer': None,
    'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}}],
  'video_embeds': [],
  'screenshots': [{'available_sizes': [[[150, 86],
      'assets/images/resized/0016/0929/160929v2-max-150x150.png'],
     [[250, 143], 'assets/images/resized/0016/0929/160929v2-max-250x250.png'],
     [[450, 258], 'assets/images/resized/0016/0929/160929v2-max-450x450.png']],
    'attribution': None}],
  'external_links': [{'external_url': 'http://www.geekwire.com/2011/rewind-ben-elowitz-wetpaint-ceo-building-type-media-company',
    'title': 'GeekWire interview: Rewind - Ben Elowitz, Wetpaint CEO, on building a new type of media company'},
   {'external_url': 'http://techcrunch.com/2012/06/17/search-and-social-how-two-will-soon-become-one/',
    'title': 'Guest post by CEO Ben Elowitz in TechCrunch'},
   {'external_url': 'http://allthingsd.com/20120516/what-to-expect-when-facebook-is-expecting-five-predictions-for-facebooks-first-public-year/',
    'title': 'Guest post by CEO Ben Elowitz in AllThingsD'},
   {'external_url': 'http://adage.com/article/digitalnext/facebook-biggest-player-advertising-s-540-billion-world/235708/',
    'title': 'Guest post by CEO Ben Elowitz in AdAge'},
   {'external_url': 'http://www.businessinsider.com/facebook-captures-14-percent-of-our-online-attention-but-only-4-percent-of-ad-spending-online-2012-6',
    'title': 'Guest post by CEO Ben Elowitz in Business Insider'},
   {'external_url': 'http://allfacebook.com/wetpaint-media-data_b75963',
    'title': 'AllFacebook coverage of Wetpaint'},
   {'external_url': 'http://adage.com/article/digital/celeb-site-wetpaint-shows-media-profit-facebook/237828/',
    'title': 'Profile of Wetpaint in Ad Age'},
   {'external_url': 'http://allthingsd.com/20121018/how-to-boost-your-facebook-traffic-tips-and-tricks-from-wetpaint/',
    'title': 'Interview with Wetpaint CEO Ben Elowitz in All Things D'},
   {'external_url': 'http://www.xconomy.com/seattle/2012/10/19/wetpaint-starts-licensing-its-facebook-based-media-distribution-tech/',
    'title': 'Profile of Wetpaint in Xconomy'}],
  'partners': []}]

In [30]:
query = {'name':'Babelgum'}

select={'name': 1, '_id': 0}

res = list(colec.find(query, select))

res

[{'name': 'Babelgum'}]

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [35]:
query = {'number_of_employees':{'$gt':5000}}

select={'name': 1,'number_of_employees':1, '_id': 0}

res = colec.find(query, select).sort('number_of_employees', -1).limit(20)

pd.DataFrame(res)

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [37]:
query = {'$and':[{'founded_year':{'$gte':2000}},
               {'founded_year':{'$lte':2005}}]}

select={'name': 1,'founded_year':1, '_id': 0}

res = colec.find(query, select).sort('founded_year', -1)

pd.DataFrame(res)

                 name  founded_year
0            Wetpaint          2005
1                Zoho          2005
2           Omnidrive          2005
3               Helio          2005
4     Jingle Networks          2005
...               ...           ...
3729          Vigilos          2000
3730     Block Shield          2000
3731          Netrake          2000
3732   EnterSys Group          2000
3733        EnteGreat          2000

[3734 rows x 2 columns]

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [53]:
query = {'$and':[{'ipo.valuation_amount':{'$gt':10e8}},
               {'founded_year':{'$lt':2010}}]}

select={'name': 1,'ipo.valuation_amount':1, '_id': 0}

res = colec.find(query, select).sort('ipo.valuation_amount', -1).limit(5)

pd.DataFrame(res)

       name                                   ipo
0      GREE  {'valuation_amount': 108960000000.0}
1  Facebook  {'valuation_amount': 104000000000.0}
2    Amazon  {'valuation_amount': 100000000000.0}
3   Twitter   {'valuation_amount': 18100000000.0}
4   Groupon   {'valuation_amount': 12800000000.0}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [8]:
query = {'$and':[{'ipo.valuation_amount':{'$gt':10e8}},
               {'founded_year':{'$lt':2010}}]}

select={'name': 1,'ipo.valuation_amount':1, '_id': 0}

res = colec.find(query, select).sort('ipo.valuation_amount', -1)

pd.DataFrame(res)

### 6. All the companies that don't include the `partners` field.

In [50]:
query = {'$nor':[{'partners':{'$gte':1}}]}

select={'name': 1,'partners':1, '_id': 0}

res = colec.find(query, select)

pd.DataFrame(res)

                      name partners
0                 Wetpaint       []
1                AdventNet       []
2                     Zoho       []
3                     Digg       []
4                 Facebook       []
...                    ...      ...
18796               Adhunk       []
18797           AfterLogic       []
18798          goBookmaker       []
18799  EnteGreat Solutions       []
18800            EnteGreat       []

[18801 rows x 2 columns]

### 7. All the companies that have a null type of value on the `category_code` field.

In [52]:
query = {'category_code':None}

select={'name': 1,'category_code':1, '_id': 0}

res = colec.find(query, select)

pd.DataFrame(res)

              name category_code
0       Collective          None
1          Snimmer          None
2           KoolIM          None
3     Level9 Media          None
4          VidKing          None
...            ...           ...
2746        Nellix          None
2747      Cantimer          None
2748  cruisecritic          None
2749      Coloroot          None
2750      Geekdive          None

[2751 rows x 2 columns]

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [54]:
query = {'$and':[{'number_of_employees':{'$gte':100}},
               {'number_of_employees':{'$lte':1000}}]}

select={'name': 1,'number_of_employees':1, '_id': 0}

res = colec.find(query, select).sort('founded_year', -1)

pd.DataFrame(res)

                                 name  number_of_employees
0                               Wamba                  120
1               Social Gaming Network                  100
2                             4shared                  666
3                             Magento                  275
4                           Integrate                  120
..                                ...                  ...
937                       Netcentives                  496
938                             Galam                  250
939                     COA Solutions                  500
940  Elite Advanced Laser Corporation                  320
941                     Willdan Group                  385

[942 rows x 2 columns]

### 9. Order all the companies by their IPO price in a descending order.

In [67]:
query = {}

select={'name': 1,'ipo.valuation_amount':1, '_id': 0}

res = colec.find(query, select).sort('ipo.valuation_amount', -1)

pd.DataFrame(res)

                      name                                   ipo
0                     GREE  {'valuation_amount': 108960000000.0}
1                 Facebook  {'valuation_amount': 104000000000.0}
2                   Amazon  {'valuation_amount': 100000000000.0}
3                  Twitter   {'valuation_amount': 18100000000.0}
4                  Groupon   {'valuation_amount': 12800000000.0}
...                    ...                                   ...
18796               Adhunk                                   NaN
18797           AfterLogic                                   NaN
18798          goBookmaker                                   NaN
18799  EnteGreat Solutions                                   NaN
18800            EnteGreat                                   NaN

[18801 rows x 2 columns]

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [60]:
query = {}

select={'name': 1,'number_of_employees':1, '_id': 0}

res = colec.find(query, select).sort('number_of_employees', -1).limit(10)

pd.DataFrame(res)

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [65]:
query = {'founded_month':{'$gte':7}}

select={'name': 1,'founded_month':1, '_id': 0}

res = colec.find(query, select).limit(1000)

pd.DataFrame(res)

             name  founded_month
0        Wetpaint             10
1            Zoho              9
2            Digg             10
3       Omnidrive             11
4            eBay              9
..            ...            ...
995      LingusTV             12
996  AccountMaven              9
997      Chapatiz             10
998       YOOWALK             10
999   Data Domain             10

[1000 rows x 2 columns]

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.00

In [68]:
query = {'$and':[{'founded_year':{'$lt':2000}},
               {'acquisition.price_amount':{'$gt':10e6}}]}

select={'name': 1,'founded_year':1, 'acquisition.price_amount':1,'_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1)

pd.DataFrame(res)

                 name  founded_year                     acquisition
0         BEA Systems          1995  {'price_amount': 8500000000.0}
1              Navteq          1985  {'price_amount': 8100000000.0}
2    Sun Microsystems          1982  {'price_amount': 7400000000.0}
3               Pixar          1986  {'price_amount': 7400000000.0}
4                 LSI          1980  {'price_amount': 6600000000.0}
..                ...           ...                             ...
200  Connect3 Systems          1993      {'price_amount': 13450000}
201      Litmus Media          1999      {'price_amount': 13000000}
202      Litmus Media          1999      {'price_amount': 13000000}
203              MIVA          1999      {'price_amount': 11600000}
204         Easyspace          1997      {'price_amount': 10500000}

[205 rows x 3 columns]

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [69]:
query = {'acquisition.acquired_year':{'$gt':2010}}

select={'name': 1, 'acquisition':1,'_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1)

pd.DataFrame(res)

,name,acquisition
0,T-Mobile,"{'price_amount': 39000000000.0, 'price_currenc..."
1,Goodrich Corporation,"{'price_amount': 18400000000.0, 'price_currenc..."
2,LSI,"{'price_amount': 6600000000.0, 'price_currency..."
3,National Semiconductor,"{'price_amount': 6500000000.0, 'price_currency..."
4,Ariba,"{'price_amount': 4300000000.0, 'price_currency..."
...,...,...
731,MediaPal,"{'price_amount': None, 'price_currency_code': ..."
732,Vertro,"{'price_amount': None, 'price_currency_code': ..."
733,ALOT,"{'price_amount': None, 'price_currency_code': ..."
734,Celestial Semiconductor,"{'price_amount': None, 'price_currency_code': ..."
735,MyChances,"{'price_amount': None, 'price_currency_code': ..."

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [70]:
query = {}

select={'name': 1, 'acquisition.acquired_year':1,'_id': 0}

res = colec.find(query, select).sort('acquisition.acquired_year', -1)

pd.DataFrame(res)

                      name              acquisition
0           Sense Networks  {'acquired_year': 2014}
1                 Nullsoft  {'acquired_year': 2014}
2                  Alverix  {'acquired_year': 2014}
3                 Wetpaint  {'acquired_year': 2013}
4                   blogTV  {'acquired_year': 2013}
...                    ...                      ...
18796               Oriact                      NaN
18797               Adhunk                      NaN
18798           AfterLogic                      NaN
18799          goBookmaker                      NaN
18800  EnteGreat Solutions                      NaN

[18801 rows x 2 columns]

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [72]:
query = {'acquisition.acquired_day':{'$lte':7}}

select={'name': 1, 'acquisition.acquired_day':1,'acquisition.price_amount':1,'_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1).limit(10)

pd.DataFrame(res)

                     name                                        acquisition
0  National Semiconductor  {'price_amount': 6500000000.0, 'acquired_day': 4}
1     The Weather Channel  {'price_amount': 3500000000.0, 'acquired_day': 7}
2        Interactive Data  {'price_amount': 3400000000.0, 'acquired_day': 4}
3              Macromedia  {'price_amount': 3400000000.0, 'acquired_day': 3}
4        Qualcomm Atheros  {'price_amount': 3100000000.0, 'acquired_day': 5}
5             ExactTarget  {'price_amount': 2500000000.0, 'acquired_day': 4}
6          Quest Software  {'price_amount': 2400000000.0, 'acquired_day': 2}
7      Legent Corporation    {'price_amount': 1740000000, 'acquired_day': 1}
8         Digital Insight    {'price_amount': 1650000000, 'acquired_day': 2}
9              Equallogic    {'price_amount': 1400000000, 'acquired_day': 5}

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [75]:
query =  {'$and':[{'category_code':'web'},
               {'number_of_employees':{'$gt':4000}}]}

select={'name': 1, 'category_code':1,'number_of_employees':1,'_id': 0}

res = colec.find(query, select).sort('number_of_employees', 1).limit(10)

pd.DataFrame(res)

                            name category_code  number_of_employees
0                        Expedia           web                 4400
1                            AOL           web                 8000
2                        Webkinz           web                 8657
3                        Rakuten           web                10000
4  Los Angeles Times Media Group           web                10000
5                        Groupon           web                10000
6                         Yahoo!           web                13600
7                           eBay           web                15000
8                       Experian           web                15500

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [83]:
query =   {'$and':[{'acquisition.price_amount':{'$gt':10e7}},
               {'acquisition.price_currency_code':'EUR'}]}

select={'name': 1, 'acquisition.price_amount':1,'acquisition.price_currency_code':1,'_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1).limit(10)

pd.DataFrame(res)

      name                                        acquisition
0  Apertio  {'price_amount': 140000000, 'price_currency_co...

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [84]:
query = {'acquisition.acquired_month':{'$lte':3}}

select={'name': 1, 'acquisition':1,'_id': 0}

res = colec.find(query, select).limit(10)

pd.DataFrame(res)

          name                                        acquisition
0         Kyte  {'price_amount': None, 'price_currency_code': ...
1   NetRatings  {'price_amount': 327000000, 'price_currency_co...
2       blogTV  {'price_amount': None, 'price_currency_code': ...
3   Livestream  {'price_amount': None, 'price_currency_code': ...
4     iContact  {'price_amount': 169000000, 'price_currency_co...
5      Coghead  {'price_amount': None, 'price_currency_code': ...
6  Dailymotion  {'price_amount': 168000000, 'price_currency_co...
7     Netvibes  {'price_amount': None, 'price_currency_code': ...
8       Flickr  {'price_amount': None, 'price_currency_code': ...
9   BabyCenter  {'price_amount': None, 'price_currency_code': ...

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [85]:
query = {'$and':[{'founded_year':{'$gte':2000}},
               {'founded_year':{'$lte':2010}},
                {'acquisition.acquired_year':{'$gte':2011}}]}


select={'name': 1,'founded_year':1, 'acquisition.acquired_year':1,'_id': 0}

res = colec.find(query, select).sort('founded_year', -1)

pd.DataFrame(res)

                   name  founded_year              acquisition
0               Magento          2010  {'acquired_year': 2011}
1                Trunkt          2009  {'acquired_year': 2012}
2             HyperWeek          2009  {'acquired_year': 2013}
3                 Shutl          2009  {'acquired_year': 2013}
4                  Honk          2009  {'acquired_year': 2011}
..                  ...           ...                      ...
481            Colibria          2000  {'acquired_year': 2011}
482        PopCap Games          2000  {'acquired_year': 2011}
483           Moonfruit          2000  {'acquired_year': 2012}
484                Telx          2000  {'acquired_year': 2011}
485  Everyday Solutions          2000  {'acquired_year': 2012}

[486 rows x 3 columns]

### 20. All the companies that have been 'deadpooled' after the third year.

In [87]:
# sin terminar
query = {'$expr':{'deadpooled_year', 'founded_year'}}
select={'name': 1,'deadpooled_year':1, 'founded_year':1,'_id': 0}
res = list(colec.find(query, select))

pd.DataFrame(res)

InvalidDocument: cannot encode object: {'founded_year', 'deadpooled_year'}, of type: <class 'set'>